bundles/org.openhab.binding.ihc/src/test/resources/ResourceValueQueryResponse33333.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getRuntimeValue2 xmlns:ns1="utcs" xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">33333</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string">resource_enum</ns1:typeString>

<ns1:value xmlns:ns2="utcs.values"  xsi:type="ns2:WSEnumValue">
<ns2:definitionTypeID xsi:type="xsd:int">4236359</ns2:definitionTypeID>

<ns2:enumValueID xsi:type="xsd:int">4236872</ns2:enumValueID>

<ns2:enumName xsi:type="xsd:string">test value</ns2:enumName>
</ns1:value>
</ns1:getRuntimeValue2>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>